MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/adc/processor/adc_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _ADC_STOP_IN_IDLE_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_ENABLE_CONTROL_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_SAMPLING_MODE_CONTROL_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON2;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_BUFFER_MODE_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON2;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_SAMPLES_PER_INTERRUPT_SELECT_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON2;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_BUFFER_FILL_STATUS_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON2;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_MUX_INPUT_SCAN_CONTROL_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON2;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_CALIBRATION_CONTROL_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON2;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_VOLTAGE_REFERENCE_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON2;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_CONVERSION_CLOCK_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON3;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_SAMPLING_ACQUISITION_TIME_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON3;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_CONVERSION_CLOCK_SOURCE_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CON3;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_MUXA_POSITIVE_INPUT_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CHS;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_MUXA_NEGATIVE_INPUT_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CHS;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_MUXB_POSITIVE_INPUT_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CHS;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_MUXB_NEGATIVE_INPUT_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CHS;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_MUX_INPUT_SCAN_SELECT_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &AD1CSSL;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_0_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_1_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_2_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF2;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_3_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF3;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_4_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF4;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_5_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF5;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_6_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF6;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_7_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF7;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_8_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF8;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_9_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUF9;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_A_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUFA;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

