MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/adc/processor/adc_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_B_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUFB;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_C_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUFC;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_D_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUFD;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_E_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUFE;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _ADC_RESULT_GETBY_INDEX_F_VREG(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return &ADC1BUFF;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_STATUS_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_DONE_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_CONTROL_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SAMP_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_CONTROL_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SAMP_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_AUTO_START_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_ASAM_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_STOP_SEQUENCE_CONTROL_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_CLRASAM_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_TRIGGER_SOURCE_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SSRC_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_FORMAT_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_FORM_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_STOP_IN_IDLE_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SIDL_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_ENABLE_CONTROL_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_ON_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_MODE_CONTROL_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_ALTS_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_BUFFER_MODE_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_BUFM_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLES_PER_INTERRUPT_SELECT_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_SMPI_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_BUFFER_FILL_STATUS_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_BUFS_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUX_INPUT_SCAN_CONTROL_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_CSCNA_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CALIBRATION_CONTROL_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_OFFCAL_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_VOLTAGE_REFERENCE_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_VCFG_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_CLOCK_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON3_ADCS_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_ACQUISITION_TIME_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON3_SAMC_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_CLOCK_SOURCE_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON3_ADRC_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXA_POSITIVE_INPUT_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0SA_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXA_NEGATIVE_INPUT_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0NA_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

