MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/adc/processor/adc_p32mx695f512h.h
PLIB_INLINE SFR_DATA _ADC_MUXB_POSITIVE_INPUT_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0SB_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXB_NEGATIVE_INPUT_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0NB_MASK;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUX_INPUT_SCAN_SELECT_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_0_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_1_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_2_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_3_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_4_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_5_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_6_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_7_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_8_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_9_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_A_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_B_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_C_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_D_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_E_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_F_MASK(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)-1;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_STATUS_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_DONE_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_CONTROL_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SAMP_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_CONTROL_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SAMP_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_AUTO_START_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_ASAM_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_STOP_SEQUENCE_CONTROL_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_CLRASAM_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_TRIGGER_SOURCE_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SSRC_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

