MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/adc/processor/adc_p32mx695f512h.h
PLIB_INLINE SFR_DATA _ADC_RESULT_FORMAT_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_FORM_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_STOP_IN_IDLE_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SIDL_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_ENABLE_CONTROL_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_ON_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_MODE_CONTROL_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_ALTS_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_BUFFER_MODE_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_BUFM_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLES_PER_INTERRUPT_SELECT_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_SMPI_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_BUFFER_FILL_STATUS_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_BUFS_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUX_INPUT_SCAN_CONTROL_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_CSCNA_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CALIBRATION_CONTROL_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_OFFCAL_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_VOLTAGE_REFERENCE_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_VCFG_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_CLOCK_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON3_ADCS_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_ACQUISITION_TIME_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON3_SAMC_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_CLOCK_SOURCE_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON3_ADRC_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXA_POSITIVE_INPUT_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0SA_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXA_NEGATIVE_INPUT_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0NA_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXB_POSITIVE_INPUT_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0SB_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXB_NEGATIVE_INPUT_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0NB_POSITION;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUX_INPUT_SCAN_SELECT_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_0_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_1_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_2_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_3_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_4_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_5_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_6_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_7_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_8_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_9_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_A_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_B_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_C_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_D_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_E_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_F_POS(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)0;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_STATUS_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_DONE_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_CONTROL_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SAMP_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

