MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/adc/processor/adc_p32mx695f512h.h
PLIB_INLINE SFR_DATA _ADC_SAMPLING_CONTROL_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SAMP_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_AUTO_START_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_ASAM_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_STOP_SEQUENCE_CONTROL_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_CLRASAM_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_TRIGGER_SOURCE_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SSRC_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_FORMAT_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_FORM_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_STOP_IN_IDLE_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_SIDL_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_ENABLE_CONTROL_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON1_ON_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_MODE_CONTROL_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_ALTS_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_BUFFER_MODE_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_BUFM_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLES_PER_INTERRUPT_SELECT_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_SMPI_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_BUFFER_FILL_STATUS_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_BUFS_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUX_INPUT_SCAN_CONTROL_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_CSCNA_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CALIBRATION_CONTROL_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_OFFCAL_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_VOLTAGE_REFERENCE_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON2_VCFG_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_CLOCK_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON3_ADCS_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_SAMPLING_ACQUISITION_TIME_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON3_SAMC_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_CONVERSION_CLOCK_SOURCE_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CON3_ADRC_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXA_POSITIVE_INPUT_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0SA_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXA_NEGATIVE_INPUT_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0NA_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXB_POSITIVE_INPUT_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0SB_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUXB_NEGATIVE_INPUT_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return _AD1CHS_CH0NB_LENGTH;
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_MUX_INPUT_SCAN_SELECT_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_0_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_1_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_2_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_3_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_4_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_5_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_6_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_7_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_8_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_9_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_A_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_B_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_C_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_D_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_E_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _ADC_RESULT_GETBY_INDEX_F_LEN(ADC_MODULE_ID i)
{
    switch (i) {
        case ADC_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

