MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/adc/processor/adc_p32mx695f512h.h
#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/adc_EnableControl_Default.h"
#include "../templates/adc_StopInIdle_Default.h"
#include "../templates/adc_CalibrationControl_Default.h"
#include "../templates/adc_MuxInputScanSelect_Default.h"
#include "../templates/adc_MuxInputScanSelectExtended_Unsupported.h"
#include "../templates/adc_VoltageReference_Default.h"
#include "../templates/adc_MuxChannel0PositiveInput_Default.h"
#include "../templates/adc_MuxChannel0NegativeInput_Default.h"
#include "../templates/adc_MuxInputScanControl_Default.h"
#include "../templates/adc_SamplingModeControl_Default.h"
#include "../templates/adc_SamplesPerInterruptSelect_Default.h"
#include "../templates/adc_SamplingAutoStart_Default.h"
#include "../templates/adc_SamplingControl_Default.h"
#include "../templates/adc_SamplingAcquisitionTime_Default.h"
#include "../templates/adc_SamplingStatus_Default.h"
#include "../templates/adc_ConversionControl_Default.h"
#include "../templates/adc_ConversionClock_Default.h"
#include "../templates/adc_ConversionClockSource_Default.h"
#include "../templates/adc_ConversionTriggerSource_Default.h"
#include "../templates/adc_ConversionStopSequenceControl_Default.h"
#include "../templates/adc_ConversionStatus_Default.h"
#include "../templates/adc_ResultFormat_Default.h"
#include "../templates/adc_ResultBufferMode_Default.h"
#include "../templates/adc_ResultBufferFillStatus_Default.h"
#include "../templates/adc_ResultGetByIndex_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_ADC_Enable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_Enable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ADC_Disable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_Disable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsEnableControl(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsEnableControl_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_StopInIdleEnable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_StopInIdleEnable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ADC_StopInIdleDisable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_StopInIdleDisable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsStopInIdleControl(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsStopInIdleControl_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_CalibrationEnable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_CalibrationEnable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ADC_CalibrationDisable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_CalibrationDisable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsCalibrationControl(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsCalibrationControl_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_InputScanMaskAdd(ADC_MODULE_ID index, ADC_INPUTS_SCAN scanInputs)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_InputScanMaskAdd_Default(index, scanInputs);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ADC_InputScanMaskRemove(ADC_MODULE_ID index, ADC_INPUTS_SCAN scanInputs)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_InputScanMaskRemove_Default(index, scanInputs);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsMuxInputScanSelect(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsMuxInputScanSelect_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADC_InputScanMaskAddExtended(ADC_MODULE_ID index, ADC_INPUTS_SCAN_EXTENDED scanInputs)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_InputScanMaskAddExtended_Unsupported(index, scanInputs);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADC_InputScanMaskRemoveExtended(ADC_MODULE_ID index, ADC_INPUTS_SCAN_EXTENDED scanInputs)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_InputScanMaskRemoveExtended_Unsupported(index, scanInputs);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsMuxInputScanSelectExtended(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsMuxInputScanSelectExtended_Unsupported(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_VoltageReferenceSelect(ADC_MODULE_ID index, ADC_VOLTAGE_REFERENCE configValue)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_VoltageReferenceSelect_Default(index, configValue);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsVoltageReference(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsVoltageReference_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

