MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/adc/processor/adc_p32mx695f512h.h
PLIB_INLINE_API void PLIB_ADC_MuxChannel0InputPositiveSelect(ADC_MODULE_ID index, ADC_MUX muxType, ADC_INPUTS_POSITIVE input)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_MuxChannel0InputPositiveSelect_Default(index, muxType, input);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsMuxChannel0PositiveInput(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsMuxChannel0PositiveInput_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_MuxChannel0InputNegativeSelect(ADC_MODULE_ID index, ADC_MUX muxType, ADC_INPUTS_NEGATIVE input)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_MuxChannel0InputNegativeSelect_Default(index, muxType, input);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsMuxChannel0NegativeInput(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsMuxChannel0NegativeInput_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_MuxAInputScanEnable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_MuxAInputScanEnable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ADC_MuxAInputScanDisable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_MuxAInputScanDisable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsMuxInputScanControl(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsMuxInputScanControl_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_SamplingModeSelect(ADC_MODULE_ID index, ADC_SAMPLING_MODE mode)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_SamplingModeSelect_Default(index, mode);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsSamplingModeControl(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsSamplingModeControl_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_SamplesPerInterruptSelect(ADC_MODULE_ID index, ADC_SAMPLES_PER_INTERRUPT value)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_SamplesPerInterruptSelect_Default(index, value);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsSamplesPerInterruptSelect(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsSamplesPerInterruptSelect_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_SampleAutoStartEnable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_SampleAutoStartEnable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ADC_SampleAutoStartDisable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_SampleAutoStartDisable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsSamplingAutoStart(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsSamplingAutoStart_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_SamplingStart(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_SamplingStart_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ADC_SamplingStop(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_SamplingStop_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsSamplingControl(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsSamplingControl_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_SampleAcquisitionTimeSet(ADC_MODULE_ID index, ADC_ACQUISITION_TIME acqTime)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_SampleAcquisitionTimeSet_Default(index, acqTime);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsSamplingAcquisitionTime(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsSamplingAcquisitionTime_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ADC_SamplingIsActive(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_SamplingIsActive_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

