MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/adc/processor/adc_p32mx695f512h.h
PLIB_INLINE_API bool PLIB_ADC_ExistsSamplingStatus(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsSamplingStatus_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_ConversionStart(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_ConversionStart_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsConversionControl(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsConversionControl_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_ConversionClockSet(ADC_MODULE_ID index, uint32_t baseFrequency, ADC_CONVERSION_CLOCK value)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_ConversionClockSet_Default(index, baseFrequency, value);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API ADC_CONVERSION_CLOCK PLIB_ADC_ConversionClockGet(ADC_MODULE_ID index, uint32_t baseFrequency)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ConversionClockGet_Default(index, baseFrequency);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (ADC_CONVERSION_CLOCK)0;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsConversionClock(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsConversionClock_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_ConversionClockSourceSelect(ADC_MODULE_ID index, ADC_CLOCK_SOURCE source)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_ConversionClockSourceSelect_Default(index, source);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsConversionClockSource(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsConversionClockSource_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_ConversionTriggerSourceSelect(ADC_MODULE_ID index, ADC_CONVERSION_TRIGGER_SOURCE source)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_ConversionTriggerSourceSelect_Default(index, source);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsConversionTriggerSource(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsConversionTriggerSource_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_ConversionStopSequenceEnable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_ConversionStopSequenceEnable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_ADC_ConversionStopSequenceDisable(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_ConversionStopSequenceDisable_Default(index);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsConversionStopSequenceControl(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsConversionStopSequenceControl_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ConversionHasCompleted(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ConversionHasCompleted_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsConversionStatus(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsConversionStatus_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_ResultFormatSelect(ADC_MODULE_ID index, ADC_RESULT_FORMAT resultFormat)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_ResultFormatSelect_Default(index, resultFormat);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsResultFormat(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsResultFormat_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_ADC_ResultBufferModeSelect(ADC_MODULE_ID index, ADC_BUFFER_MODE mode)
{
    switch (index) {
        case ADC_ID_1 :
            ADC_ResultBufferModeSelect_Default(index, mode);
            break;
        case ADC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsResultBufferMode(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsResultBufferMode_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API ADC_RESULT_BUF_STATUS PLIB_ADC_ResultBufferStatusGet(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ResultBufferStatusGet_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (ADC_RESULT_BUF_STATUS)0;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsResultBufferFillStatus(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsResultBufferFillStatus_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API ADC_SAMPLE PLIB_ADC_ResultGetByIndex(ADC_MODULE_ID index, uint8_t bufferIndex)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ResultGetByIndex_Default(index, bufferIndex);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (ADC_SAMPLE)0;
    }
}

PLIB_INLINE_API bool PLIB_ADC_ExistsResultGetByIndex(ADC_MODULE_ID index)
{
    switch (index) {
        case ADC_ID_1 :
            return ADC_ExistsResultGetByIndex_Default(index);
        case ADC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

#endif
